In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
from sqlalchemy import text
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [2]:
# 1 create connection to sakila db
sd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+ sd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [8]:
# 2 retrieve the rental data for the specified month and year from the rental table in the Sakila database, 
# and return it as a pandas DataFramdef rentals_month (month, year):
    with engine.connect() as connection:
        txt = f'''SELECT *
                FROM rental
                WHERE MONTH(rental_date) = {month}
                AND YEAR(rental_date) = {year};'''
        query = text(txt)
        result = connection.execute(query)
        return pd.DataFrame(result.all())

In [16]:
df_rentals_month = rentals_month(5,2005)
df_rentals_month
df_rentals_month2 = rentals_month(7,2005)
df_rentals_month2

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,3470,2005-07-05 22:49:24,883,565,2005-07-07 19:36:24,1,2006-02-15 21:30:53
1,3471,2005-07-05 22:51:44,1724,242,2005-07-13 01:38:44,2,2006-02-15 21:30:53
2,3472,2005-07-05 22:56:33,841,37,2005-07-13 17:18:33,2,2006-02-15 21:30:53
3,3473,2005-07-05 22:57:34,2735,60,2005-07-12 23:53:34,1,2006-02-15 21:30:53
4,3474,2005-07-05 22:59:53,97,594,2005-07-08 20:32:53,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
6704,10176,2005-07-31 23:40:35,1181,19,2005-08-09 00:46:35,2,2006-02-15 21:30:53
6705,10177,2005-07-31 23:42:33,2242,279,2005-08-03 01:30:33,2,2006-02-15 21:30:53
6706,10178,2005-07-31 23:43:04,1582,491,2005-08-03 00:43:04,1,2006-02-15 21:30:53
6707,10179,2005-07-31 23:49:54,2136,131,2005-08-01 20:46:54,2,2006-02-15 21:30:53
6708,10180,2005-07-31 23:57:43,757,50,2005-08-09 04:04:43,2,2006-02-15 21:30:53

In [10]:
# 3 takes the DataFrame provided by rentals_month as input along with the month and year
# and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.
# include the month and year as parameters and use them to name the new column according to the month and year

def rental_count_month(df, month, year):
    # name column with month and year
    column_name = f"rentals_{month:02d}_{year}"
    
    # group by cust id and count the rentals, reset index and set new column-name
    rental_counts = df.groupby('customer_id').size().reset_index(name=column_name)
    
    return rental_counts

In [15]:
df_rental_cust_month = rental_count_month(df_rentals_month, 5,2005)
df_rental_cust_month

     customer_id  rentals_05_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

In [19]:
df_rental_cust_month2 = rental_count_month(df_rentals_month, 7,2005)
df_rental_cust_month2

     customer_id  rentals_07_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [21]:
# 4 takes two DataFrames as input containing the number of rentals made by each customer in different months and years
# return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals 
# in the two months


def compare_rentals(df1, df2, month1, year1, month2, year2):
    # Benenne die Spalten so, dass sie die Monats- und Jahresangaben enthalten
    col_name1 = f"rentals_{month1:02d}_{year1}"
    col_name2 = f"rentals_{month2:02d}_{year2}"
    
    # Merge the two DataFrames based on 'customer_id'
    merged_df = pd.merge(df1, df2, on='customer_id', how='outer', suffixes=(f"_{month1:02d}_{year1}", f"_{month2:02d}_{year2}"))
    
    # Fill NaN values with 0, since missing customers in either month means they had 0 rentals in that period
    merged_df[col_name1] = merged_df[col_name1].fillna(0)
    merged_df[col_name2] = merged_df[col_name2].fillna(0)
    
    # Calculate the difference between the two months
    merged_df['difference'] = merged_df[col_name1] - merged_df[col_name2]
    
    return merged_df

In [23]:
df_merged = compare_rentals(df_rental_cust_month, df_rental_cust_month2, 5, 2005, 7, 2005)
df_merged

     customer_id  rentals_05_2005  rentals_07_2005  difference
0              1              7.0              2.0         5.0
1              2              1.0              1.0         0.0
2              3              4.0              2.0         2.0
3              4              6.0              0.0         6.0
4              5              5.0              3.0         2.0
..           ...              ...              ...         ...
593          401              0.0              3.0        -3.0
594          433              0.0              2.0        -2.0
595          440              0.0              1.0        -1.0
596          445              0.0              2.0        -2.0
597          475              0.0              2.0        -2.0

[598 rows x 4 columns]